/* 12. 기본 주민등록코드에는 각 숫자에 대응하는 가중치가 있다. 가중치는 주민등록번호의 순서에 따라 2 3 4 5 6 7 8
9 2 3 4 5 이다.
먼저 마지막 숫자는 제외하고, 기본코드의 각 12자리와 가중치를 모두 곱하여 합한다.
합한 값을 11로 나눈 나머지 값을 구한다.
11에서 그 나머지 값을 뺀 후, 이를 10을 나눈 나머지를 구한다.
나머지의 1의 자리 값과 주민등록번호 마지막 자리 값이 맞아야 유효한 주민등록번호이다. */

ssn = [9,5,0,8,3,0,2,2,3,6,4,1,6];
let k=2;
let sum =0;
for (let i=0; i<ssn.length-1; i++) {
    sum += ssn[i]*k;
    k++;
    if (k>9) {
        k=2;
    }
}
let mod = sum % 11;
let x = (11-mod) % 10;
let y = x % 10;
if (y == ssn[ssn.length-1]) {
    console.log("유효한 주민번호");
} else {
    console.log("유효하지 않은 주민번호");
}
